loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/standard_lib/uos/vfs_spiffs.c
/*
 * This file is part of the MicroPython K210 project, https://github.com/loboris/MicroPython_K210_LoBo
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 LoBo (https://github.com/loboris)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/mpconfig.h"
#if MICROPY_VFS_SPIFFS

#if !MICROPY_VFS
#error "with MICROPY_VFS_SPIFFS enabled, MICROPY_VFS must also be enabled"
#endif

#include <string.h>
#include <sys/stat.h>
#include "syslog.h"
#include "py/runtime.h"
#include "py/mperrno.h"
#include "py/binary.h"
#include "py/objarray.h"

#include "lib/timeutils/timeutils.h"

#include "spiffs_nucleus.h"
#include "vfs_spiffs.h"
#include "spiffs_config.h"
#include "w25qxx.h"

int spiffs_dbg_level = 0;
bool force_erase_fs_flash = false;

#if _MAX_SS == _MIN_SS
#define SECSIZE(fs) (_MIN_SS)
#else
#define SECSIZE(fs) ((fs)->ssize)
#endif

#define mp_obj_spiffs_vfs_t spiffs_user_mount_t

#define SPIFFS_MAX_OPEN_FILES   4

//const mp_obj_type_t mp_spiffs_vfs_type;

static char spiffs_current_dir[SPIFFS_OBJ_NAME_LEN-8] = {'\0'};
static char spiffs_file_path[SPIFFS_OBJ_NAME_LEN] = {'\0'};

static u8_t spiffs_work_buf[SPIFFS_CFG_LOG_PAGE_SZ(fs) * 2];
static u8_t spiffs_fds[sizeof(spiffs_fd) * SPIFFS_MAX_OPEN_FILES + 8] = {0};
#if SPIFFS_CACHE
static u8_t spiffs_cache_buf[SPIFFS_CFG_LOG_PAGE_SZ(fs)*2];
#endif
static SemaphoreHandle_t spiffs_lock = NULL; // FS lock

static const char* TAG = "[VFS_SPIFFS]";

spiffs_user_mount_t spiffs_user_mount_handle;
spiffs_user_mount_t* vfs_spiffs = &spiffs_user_mount_handle;
void *vfs_flashfs = &spiffs_user_mount_handle;

static int *fs_check = NULL;

typedef struct _mp_vfs_spiffs_ilistdir_it_t {
    mp_obj_base_t base;
    mp_fun_1_t iternext;
    bool is_str;
    spiffs_DIR dir;
    char path[SPIFFS_OBJ_NAME_LEN];
} mp_vfs_spiffs_ilistdir_it_t;


#if SPIFFS_HAL_CALLBACK_EXTRA
//--------------------------------------------------------------------------------------------------------------------
static void mp_spiffs_check_cb(spiffs *fs, spiffs_check_type type, spiffs_check_report report, u32_t arg1, u32_t arg2)
#else
//--------------------------------------------------------------------------------------------------------
static void mp_spiffs_check_cb(spiffs_check_type type, spiffs_check_report report, u32_t arg1, u32_t arg2)
#endif
{
    if (fs_check) {
        if (report == SPIFFS_CHECK_PROGRESS) fs_check[SPIFFS_CHECK_PROGRESS]++;
        else if (report == SPIFFS_CHECK_ERROR) fs_check[SPIFFS_CHECK_ERROR]++;
        else if (report == SPIFFS_CHECK_FIX_INDEX) fs_check[SPIFFS_CHECK_FIX_INDEX]++;
        else if (report == SPIFFS_CHECK_FIX_LOOKUP) fs_check[SPIFFS_CHECK_FIX_LOOKUP]++;
        else if (report == SPIFFS_CHECK_DELETE_ORPHANED_INDEX) fs_check[SPIFFS_CHECK_DELETE_ORPHANED_INDEX]++;
        else if (report == SPIFFS_CHECK_DELETE_PAGE) fs_check[SPIFFS_CHECK_DELETE_PAGE]++;
        else if (report == SPIFFS_CHECK_DELETE_BAD_FILE) fs_check[SPIFFS_CHECK_DELETE_BAD_FILE]++;
    }
    return;
}

//------------------------------
void spiffs_api_lock(spiffs *fs)
{
    xSemaphoreTake(spiffs_lock, portMAX_DELAY);
}

//--------------------------------
void spiffs_api_unlock(spiffs *fs)
{
    xSemaphoreGive(spiffs_lock);
}

//---------------------------------------------
const char *spiffs_local_path(const char *path)
{
    const char *lpath = path;
    if (lpath[0] == '/') {
        lpath++; // absolute path
        int len = strlen(lpath);
        if (lpath[len-1] == '/') {
            strcpy(spiffs_file_path, lpath);
            spiffs_file_path[len-1] = '\0';
            lpath = spiffs_file_path;
        }
    }
    else {
        if (strstr(lpath, "..") == lpath) {
            // parent directory
            lpath += 2;
            if (lpath[0] == '/') lpath++;
            sprintf(spiffs_file_path, "%s", spiffs_current_dir);
            char *ppath = strrchr(spiffs_file_path, '/');
            if (ppath) *ppath = '\0';
            strcat(spiffs_file_path, lpath);
        }
        else {
            if (strstr(lpath, ".") == lpath) lpath += 1;
            if (strstr(lpath, "flash/") == lpath) lpath += 6;
            snprintf(spiffs_file_path, SPIFFS_OBJ_NAME_LEN, "%s/%s", spiffs_current_dir, lpath);
        }
        int len = strlen(spiffs_file_path);
        while ((len > 0) && (spiffs_file_path[len-1] == '/')) {
            spiffs_file_path[len-1] = '\0';
            len = strlen(spiffs_file_path);
        }
        lpath = spiffs_file_path;
        if (lpath[0] == '/') lpath++;
    }
    LOGD(TAG, "LOCAL_PATH [%s]->[%s], currdir=[%s]", path, lpath, spiffs_current_dir);
    return lpath;
}

//--------------------------------------
MP_NOINLINE bool init_flash_filesystem()
{
    spiffs_lock = xSemaphoreCreateMutex();
    configASSERT(spiffs_lock);

    w25qxx_clear_counters();
    vfs_spiffs->flags = SYS_SPIFFS;
    vfs_spiffs->base.type = &mp_spiffs_vfs_type;
    vfs_spiffs->fs.user_data = vfs_spiffs;
    vfs_spiffs->cfg.hal_read_f = (spiffs_read)sys_spiffs_read;
    vfs_spiffs->cfg.hal_write_f = (spiffs_write)sys_spiffs_write;
    vfs_spiffs->cfg.hal_erase_f = (spiffs_erase)sys_spiffs_erase;
    #if SPIFFS_SINGLETON == 0
    vfs_spiffs->cfg.phys_size = SPIFFS_CFG_PHYS_SZ();               // use all spi flash
    vfs_spiffs->cfg.phys_addr = SPIFFS_CFG_PHYS_ADDR();             // start spiffs at start of spi flash
    vfs_spiffs->cfg.phys_erase_block = SPIFFS_CFG_PHYS_ERASE_SZ();  // according to datasheet
    vfs_spiffs->cfg.log_block_size = SPIFFS_CFG_LOG_BLOCK_SZ();     // let us not complicate things
    vfs_spiffs->cfg.log_page_size = SPIFFS_CFG_LOG_PAGE_SZ();       // as we said
    #endif

    if (force_erase_fs_flash) {
        // Erase first 4 blocks (force format)
        for (int i=MICRO_PY_FLASHFS_START_ADDRESS; i<(MICRO_PY_FLASHFS_START_ADDRESS+4); i++) {
            sys_spiffs_erase(i, w25qxx_FLASH_SECTOR_SIZE);
        }
    }
    LOGD(TAG, "Spiffs mount.");

    int res = SPIFFS_mount(&vfs_spiffs->fs,
                       &vfs_spiffs->cfg,
                       spiffs_work_buf,
                       spiffs_fds,
                       sizeof(spiffs_fds),
#if SPIFFS_CACHE
                        spiffs_cache_buf,
                        sizeof(spiffs_cache_buf),
#else
                        NULL,
                        0,
#endif
                        (void *)mp_spiffs_check_cb);
    if (res != SPIFFS_OK || res == SPIFFS_ERR_NOT_A_FS)
    {
        SPIFFS_unmount(&vfs_spiffs->fs);
        LOGD(TAG, "Spiffs Unmount.");
        mp_printf(&mp_plat_print, "[VFS_SPIFFS] Spiffs formating (this may take some time) ...\n");

        vfs_spiffs->fs.block_count = SPIFFS_CFG_PHYS_SZ(fs) / SPIFFS_CFG_LOG_BLOCK_SZ(fs);
        s32_t format_res = SPIFFS_format(&vfs_spiffs->fs);
        if (format_res) {
            LOGE(TAG, "Format failed");
            return false;
        }
        else {
            LOGD(TAG, "Format successful");
        }

