loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/standard_lib/uos/vfs_spiffs.c
        res = SPIFFS_mount(&vfs_spiffs->fs,
            &vfs_spiffs->cfg,
            spiffs_work_buf,
            spiffs_fds,
            sizeof(spiffs_fds),
#if SPIFFS_CACHE
            spiffs_cache_buf,
            sizeof(spiffs_cache_buf),
#else
            NULL,
            0,
#endif
            0);
        LOGD(TAG, "Mount %s ", res ? "failed":"successful");
        if (res != SPIFFS_OK) return false;
    }
    else {
        LOGD(TAG, "Mount successful");
    }

    mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
    if (vfs == NULL) {
        LOGE(TAG, "Cannot create new VFS");
    }
    vfs->str = "/flash";
    vfs->len = 6;
    vfs->obj = MP_OBJ_FROM_PTR(vfs_spiffs);
    vfs->next = NULL;
    mp_vfs_mount_t *vfs_sys = MP_STATE_VM(vfs_mount_table);
    if (vfs_sys == NULL) {
        MP_STATE_VM(vfs_mount_table) = vfs;
    }
    else {
        vfs_sys->next = vfs;
    }
    LOGD(TAG, "Flash VFS registered.");
    sprintf(spiffs_current_dir, "%s", "");

    return true;
}

//--------------------------------------------------------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args)
{
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    // Return existing spiffs vfs object
    for (mp_vfs_mount_t *vfs = MP_STATE_VM(vfs_mount_table); vfs != NULL; vfs = vfs->next) {
        if ((vfs->len == 6) && (strcmp(vfs->str, "/flash") == 0)) {
            return vfs->obj;
        }
    }
    mp_raise_NotImplementedError("System spiffs not found");
    return mp_const_none;
}

//---------------------------------------------------------------------------
STATIC mp_import_stat_t spiffs_vfs_import_stat(void *vfs_in,const char *path)
{
    spiffs_user_mount_t *vfs = vfs_in;
    spiffs_stat  fno;
    if (vfs == NULL) return MP_IMPORT_STAT_NO_EXIST;

    const char *lpath = spiffs_local_path(path);

    int res = SPIFFS_stat(&vfs->fs, lpath, &fno);
    if (res == SPIFFS_OK) {
        vfs_spiffs_meta_t *meta = (vfs_spiffs_meta_t *)&fno.meta;
        if (meta->type == SPIFFS_TYPE_DIR) return MP_IMPORT_STAT_DIR;
        else return MP_IMPORT_STAT_FILE;
    }
    return MP_IMPORT_STAT_NO_EXIST;
}

/*
//----------------------------------------------
STATIC mp_obj_t spiffs_vfs_del(mp_obj_t self_in)
{
    mp_raise_NotImplementedError("System spiffs is always mounted");
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_del_obj, spiffs_vfs_del);
*/

//-----------------------------------------------
STATIC mp_obj_t spiffs_vfs_mkfs(mp_obj_t self_in)
{
    mp_raise_NotImplementedError("System Flash FS is always in use");
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_mkfs_fun_obj, spiffs_vfs_mkfs);
STATIC MP_DEFINE_CONST_STATICMETHOD_OBJ(spiffs_vfs_mkfs_obj, MP_ROM_PTR(&spiffs_vfs_mkfs_fun_obj));


//------------------------------------------------------------------
STATIC mp_obj_t mp_vfs_spiffs_ilistdir_it_iternext(mp_obj_t self_in)
{
    mp_vfs_spiffs_ilistdir_it_t *self = MP_OBJ_TO_PTR(self_in);
	struct spiffs_dirent de;
	struct spiffs_dirent* de_ret;

	for (;;) {
		de_ret = SPIFFS_readdir(&self->dir, &de);		
        char *fn = (char *)de.name;
        if (de_ret == NULL || fn[0] == 0) {
            // stop on error or end of directory
            break;
        }
        // Note that SPIFFS already filters . and .., so we don't need to

        // Check if the name is in the selected directory
        char *fname = fn;
        char dirname[strlen(fn)+1];
        strcpy(dirname, fn);
        char *dirend = strrchr(dirname, '/');
        if (dirend != NULL) {
            fname += (dirend - dirname) + 1;
            *dirend = '\0';
        }
        else dirname[0] = '\0';
        if (strcmp(self->path, dirname) != 0) continue;

        // make 4-tuple with info about this entry
        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(4, NULL));
        if (self->is_str) {
            t->items[0] = mp_obj_new_str(fname, strlen(fname));
        } else {
            t->items[0] = mp_obj_new_bytes((const byte*)fname, strlen(fname));
        }
        vfs_spiffs_meta_t * meta = (vfs_spiffs_meta_t *)&de.meta;
        if (meta->type == SPIFFS_TYPE_DIR) {
            // dir
            t->items[1] = mp_obj_new_int(MP_S_IFDIR);
        } 
		else{
            // file
            t->items[1] = mp_obj_new_int(MP_S_IFREG);
        }
        t->items[2] = mp_obj_new_int(0); // no inode number
        t->items[3] = mp_obj_new_int_from_uint(de.size);

        return MP_OBJ_FROM_PTR(t);
    }

    // ignore error because we may be closing a second time
    SPIFFS_closedir(&self->dir);

    return MP_OBJ_STOP_ITERATION;
}

//---------------------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_ilistdir_func(size_t n_args, const mp_obj_t *args)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(args[0]);
    bool is_str_type = true;
    const char *path;
    char *lpath;
    if (n_args == 2) {
        if (mp_obj_get_type(args[1]) == &mp_type_bytes) {
            is_str_type = false;
        }
        path = mp_obj_str_get_str(args[1]);
        lpath = (char *)spiffs_local_path(path);
    }
    else lpath = spiffs_current_dir;
    LOGD(TAG, "LISTDIR [%s]", lpath);

    if (strlen(lpath) > 0) {
        // Check if requested path is a directory
        spiffs_stat  fno;
        int res = SPIFFS_stat(&(self->fs), lpath, &fno);
        if (res == SPIFFS_OK) {
            vfs_spiffs_meta_t * meta = (vfs_spiffs_meta_t *)&fno.meta;
            if (meta->type != SPIFFS_TYPE_DIR) res = -1;
        }
        if (res != SPIFFS_OK) {
            mp_raise_OSError(MP_ENOTDIR);
        }
    }

    // Create a new iterator object to list the directory
    mp_vfs_spiffs_ilistdir_it_t *iter = m_new_obj(mp_vfs_spiffs_ilistdir_it_t);
    iter->base.type = &mp_type_polymorph_iter;
    iter->iternext = mp_vfs_spiffs_ilistdir_it_iternext;
    iter->is_str = is_str_type;
    strcpy(iter->path, lpath);
	if (!SPIFFS_opendir(&(self->fs), lpath, &iter->dir)) {
        mp_raise_OSError(MP_ENOTDIR);
    }

    return MP_OBJ_FROM_PTR(iter);
	
