loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/standard_lib/uos/vfs_spiffs.c
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(spiffs_vfs_ilistdir_obj, 1, 2, spiffs_vfs_ilistdir_func);

//----------------------------------------------------
static bool is_dir_empty(spiffs *fs, const char *path)
{
    spiffs_DIR dir;
    struct spiffs_dirent de;
    struct spiffs_dirent* de_ret;
    bool is_empty = true;

    if (!SPIFFS_opendir(fs, path, &dir)) return false;

    for (;;) {
        de_ret = SPIFFS_readdir(&dir, &de);
        char *fn = (char *)de.name;
        if (de_ret == NULL || fn[0] == 0) {
            // stop on error or end of dir
            break;
        }
        // Note that FatFS already filters . and .., so we don't need to

        if (strstr(fn, path) == path) {
            is_empty = false;
            break;
        }
    }
    SPIFFS_closedir(&dir);
    return is_empty;
}

//----------------------------------------------
static int _is_dir(spiffs *fs, const char *path)
{
    // Check if file is directory
    spiffs_stat fno;
    int res;

    res = SPIFFS_stat(fs, path, &fno);
    if (res != SPIFFS_OK) {
        SPIFFS_clearerr(fs);
        return res;
    }
    vfs_spiffs_meta_t *meta = (vfs_spiffs_meta_t *)&fno.meta;
    if (meta->type == SPIFFS_TYPE_DIR) return 1;
    return 0;
}

//------------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_remove(mp_obj_t vfs_in, mp_obj_t path_in)
{
	spiffs_user_mount_t *self = MP_OBJ_TO_PTR(vfs_in);
	const char *path = mp_obj_str_get_str(path_in);
    const char *lpath = spiffs_local_path(path);
    int res;

    // Check if file is directory
    res = _is_dir(&(self->fs), lpath);
    if (res < 0) {
        mp_raise_OSError(MP_ENOENT);
    }
    if (res == 1) {
        // It is directory, cannot be removed
        mp_raise_OSError(MP_EISDIR);
    }

    res = SPIFFS_remove(&(self->fs), lpath);
    if (res != SPIFFS_OK) {
        SPIFFS_clearerr(&(self->fs));
		mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_remove_obj, spiffs_vfs_remove);


//-------------------------------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_rename(mp_obj_t vfs_in, mp_obj_t path_in, mp_obj_t path_out)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(vfs_in);
    const char *old_path = mp_obj_str_get_str(path_in);
    const char *new_path = mp_obj_str_get_str(path_out);
    const char *lold_path = spiffs_local_path(old_path);
    const char *lnew_path = spiffs_local_path(new_path);
    int res;

    res = SPIFFS_rename(&(self->fs), lold_path, lnew_path);
    if (res == SPIFFS_ERR_CONFLICTING_NAME){
        // if new_path exists then try removing it (but only if it's a file)
        res = _is_dir(&(self->fs), lnew_path);
        if (res < 0) {
            mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
        }
        if (res == 1) {
            // It is directory, cannot be removed
            mp_raise_OSError(MP_EISDIR);
        }
        res = SPIFFS_remove(&(self->fs), lnew_path); //remove file
        if (res < 0) {
            mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
        }
        // try to rename again
        res = SPIFFS_rename(&(self->fs), lold_path, lnew_path);
        if (res < 0) {
            mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
        }
    }
    else if (res == SPIFFS_OK) {
        return mp_const_none;
    }
    else {
        SPIFFS_clearerr(&(self->fs));
        mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(spiffs_vfs_rename_obj, spiffs_vfs_rename);

//----------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_mkdir(mp_obj_t vfs_in, mp_obj_t path_o)
{
    spiffs_user_mount_t* self = MP_OBJ_TO_PTR(vfs_in);
    const char *path = mp_obj_str_get_str(path_o);
    const char *lpath = spiffs_local_path(path);
    int res;

    // Check if the directory or file with the same name exists
    res = _is_dir(&(self->fs), lpath);
    if (res >= 0) {
        // It is directory, cannot be removed
        mp_raise_OSError(MP_EEXIST);
    }

    int fd = SPIFFS_open(&(self->fs), lpath, SPIFFS_CREAT | SPIFFS_WRONLY, 0);
    if (fd < 0) {
        SPIFFS_clearerr(&(self->fs));
        mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(fd)]);
    }
    vfs_spiffs_update_meta(&(self->fs), fd, SPIFFS_TYPE_DIR);
    //if (!vfs_spiffs_update_meta(&(self->fs), fd, SPIFFS_TYPE_DIR)) {
    //    mp_raise_OSError(MP_EIO);
    //}

    res = SPIFFS_close(&(self->fs), fd);
    if (res < 0) {
        SPIFFS_clearerr(&(self->fs));
        mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_mkdir_obj, spiffs_vfs_mkdir);

//--------------------------------------------------------------
STATIC mp_obj_t fat_vfs_rmdir(mp_obj_t vfs_in, mp_obj_t path_in)
{
    spiffs_user_mount_t* vfs = MP_OBJ_TO_PTR(vfs_in);
    const char *path = mp_obj_str_get_str(path_in);
    const char *lpath = spiffs_local_path(path);
    int res;

    // Check if directory
    res = _is_dir(&vfs->fs, lpath);
    if (res < 0) {
        mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    if (res == 0) {
        // Not a directory
        mp_raise_OSError(MP_ENOTDIR);
    }
    // Check if  directory is empty
    if (!is_dir_empty(&vfs->fs, lpath)) {
        mp_raise_OSError(MP_EPERM);
    }

    res = SPIFFS_remove(&vfs->fs, lpath);
    if (res < 0) {
        SPIFFS_clearerr(&vfs->fs);
        mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_rmdir_obj, fat_vfs_rmdir);

// Change current directory.
//-----------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_chdir(mp_obj_t vfs_in, mp_obj_t path_in)
{
    spiffs_user_mount_t* vfs = MP_OBJ_TO_PTR(vfs_in);
    const char *path = mp_obj_str_get_str(path_in);
    int res;

    if ((path[0] != 0) && !(path[0] == '/' && path[1] == 0)) {
        const char *lpath = spiffs_local_path(path);
        // Check if directory
        res = _is_dir(&vfs->fs, lpath);
        if (res < 0) {
            mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
        }
        if (res == 0) {
            // Not a directory
            mp_raise_OSError(MP_ENOTDIR);
        }
        sprintf(spiffs_current_dir, "/%s", lpath);
        LOGD(TAG, "CHDIR currdir=[%s]", spiffs_current_dir);
    }
    else sprintf(spiffs_current_dir, "%s", "");
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_chdir_obj, spiffs_vfs_chdir);

// Get the current directory.
//------------------------------------------------
STATIC mp_obj_t spiffs_vfs_getcwd(mp_obj_t vfs_in)
{
    LOGD(TAG, "GETCWD [%s]", spiffs_current_dir);
    return mp_obj_new_str(spiffs_current_dir, strlen(spiffs_current_dir));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_getcwd_obj, spiffs_vfs_getcwd);

// function stat(path)
// Get the status of a file or directory.
//----------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_stat(mp_obj_t vfs_in, mp_obj_t path_in)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(vfs_in);
    const char *path = mp_obj_str_get_str(path_in);
    int res;

    mp_int_t mode = MP_S_IFDIR;
    mp_int_t size = 0;
    mp_int_t time = 0;

    if ((path[0] != 0) && !(path[0] == '/' && path[1] == 0)) {
        const char *lpath = spiffs_local_path(path);
        spiffs_stat fno;
        res = SPIFFS_stat(&(self->fs), lpath, &fno);
        if (res != SPIFFS_OK) {
            mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
        }
        size = fno.size;
        vfs_spiffs_meta_t * meta = (vfs_spiffs_meta_t *)&fno.meta;
        if (meta->type == SPIFFS_TYPE_DIR) mode = MP_S_IFDIR;
        else mode = MP_S_IFREG;
        time = meta->mtime;
    }

