loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/standard_lib/uos/vfs_spiffs.c
    mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(10, NULL));
    t->items[0] = mp_obj_new_int(mode); // st_mode
    t->items[1] = mp_obj_new_int(0); // st_ino
    t->items[2] = mp_obj_new_int(0); // st_dev
    t->items[3] = mp_obj_new_int(0); // st_nlink
    t->items[4] = mp_obj_new_int(0); // st_uid
    t->items[5] = mp_obj_new_int(0); // st_gid
    t->items[6] = mp_obj_new_int_from_uint(size); // st_size
    t->items[7] = mp_obj_new_int(time); // st_atime
    t->items[8] = t->items[7]; // st_mtime
    t->items[9] = t->items[7]; // st_ctime

    return MP_OBJ_FROM_PTR(t);

}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_stat_obj, spiffs_vfs_stat);

// Get the status of a VFS.
//-------------------------------------------------------------------
STATIC mp_obj_t spiffs_vfs_statvfs(mp_obj_t vfs_in, mp_obj_t path_in)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(vfs_in);

    spiffs *spif_fs = &(self->fs);
	u32_t total, used;
    int res;

    res = SPIFFS_info(spif_fs, &total,&used);
    if (res != SPIFFS_OK) {
        SPIFFS_clearerr(&(self->fs));
		mp_raise_OSError(SPIFFS_errno_table[GET_ERR_CODE(res)]);
    }
    mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(10, NULL));

    t->items[0] = mp_obj_new_int(SPIFFS_CFG_LOG_PAGE_SZ());               // file system block size
    t->items[1] = t->items[0];                                            // fragment size
    t->items[2] = mp_obj_new_int(total/SPIFFS_CFG_LOG_PAGE_SZ());         // size of fs in f_frsize units
    t->items[3] = mp_obj_new_int((total-used)/SPIFFS_CFG_LOG_PAGE_SZ());  // f_bfree
    t->items[4] = t->items[3];                                            // f_bavail
    t->items[5] = mp_obj_new_int(0); // f_files
    t->items[6] = mp_obj_new_int(0); // f_ffree
    t->items[7] = mp_obj_new_int(0); // f_favail
    t->items[8] = mp_obj_new_int(0); // f_flags
    t->items[9] = mp_obj_new_int(SPIFFS_OBJ_NAME_LEN);                    // f_namemax

    return MP_OBJ_FROM_PTR(t);

}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_statvfs_obj, spiffs_vfs_statvfs);

//----------------------------------------------------------------------------------
STATIC mp_obj_t vfs_spiffs_mount(mp_obj_t self_in, mp_obj_t readonly, mp_obj_t mkfs)
{
    mp_raise_NotImplementedError("System spiffs is always mounted");
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(vfs_spiffs_mount_obj, vfs_spiffs_mount);

//-------------------------------------------------
STATIC mp_obj_t vfs_spiffs_umount(mp_obj_t self_in)
{
    mp_raise_NotImplementedError("Only system spiffs is used");
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_umount_obj, vfs_spiffs_umount);

//-------------------------------------------------
STATIC mp_obj_t vfs_spiffs_check(mp_obj_t self_in)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(self_in);

    int check[7] = {0};
    fs_check = &check[0];
    mp_printf(&mp_plat_print, "\r\nChecking spiffs, please wait...\r\n");

    SPIFFS_clearerr(&(self->fs));
    SPIFFS_check(&(self->fs));
    fs_check = NULL;
    mp_printf(&mp_plat_print, "Finished.\r\n");
    mp_printf(&mp_plat_print, "--------------\r\n");
    mp_printf(&mp_plat_print, " Checks      : %d\r\n", check[SPIFFS_CHECK_PROGRESS]);
    mp_printf(&mp_plat_print, " Errors      : %d\r\n", check[SPIFFS_CHECK_ERROR]);
    mp_printf(&mp_plat_print, " Fix index   : %d\r\n", check[SPIFFS_CHECK_FIX_INDEX]);
    mp_printf(&mp_plat_print, " Fix look up : %d\r\n", check[SPIFFS_CHECK_FIX_LOOKUP]);
    mp_printf(&mp_plat_print, " Del orph pg : %d\r\n", check[SPIFFS_CHECK_DELETE_ORPHANED_INDEX]);
    mp_printf(&mp_plat_print, " Del pages   : %d\r\n", check[SPIFFS_CHECK_DELETE_PAGE]);
    mp_printf(&mp_plat_print, " Del bad file: %d\r\n", check[SPIFFS_CHECK_DELETE_BAD_FILE]);
    mp_printf(&mp_plat_print, "--------------\r\n");

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_check_obj, vfs_spiffs_check);

//---------------------------------------------------------------
STATIC mp_obj_t vfs_spiffs_gc(size_t n_args, const mp_obj_t *args)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(args[0]);

    if (SPIFFS_mounted(&(self->fs)) == false) {
        mp_raise_OSError(MP_ENOENT);
    }
    int n = 1;
    if (n_args >= 2) {
        n = mp_obj_get_int(args[1]);
        if (n < 1) n = 1;
        if (n > 64) n = 64;
    }
    int max_fp = 0;
    if (n_args >= 3) {
        max_fp = mp_obj_get_int(args[2]);
        if (max_fp < 0) max_fp = 0;
        if (max_fp > 50) max_fp = 50;
    }

    mp_printf(&mp_plat_print, "Starting spiffs garbage collection, please wait...\r\n");
    int nf = 0;
    SPIFFS_clearerr(&(self->fs));
    for (int i=0; i<n; i++) {
        if (SPIFFS_gc_quick(&(self->fs), max_fp) < 0) break;
        if (SPIFFS_errno(&(self->fs)) == SPIFFS_OK) nf++;
        SPIFFS_clearerr(&(self->fs));
    }
    mp_printf(&mp_plat_print, "Finished: %d %dK block(s) erased.\r\n", nf, SPIFFS_CFG_LOG_BLOCK_SZ(fs)/1024);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(spiffs_vfs_gc_obj, 1, 3, vfs_spiffs_gc);

#if SPIFFS_TEST_VISUALISATION
//----------------------------------------------
STATIC mp_obj_t vfs_spiffs_vis(mp_obj_t self_in)
{
    spiffs_user_mount_t *self = MP_OBJ_TO_PTR(self_in);

    SPIFFS_clearerr(&(self->fs));
    SPIFFS_vis(&(self->fs));

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_vis_obj, vfs_spiffs_vis);
#else
//----------------------------------------------
STATIC mp_obj_t vfs_spiffs_vis(mp_obj_t self_in)
{
    mp_raise_NotImplementedError("Only system spiffs is used");

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(spiffs_vfs_vis_obj, vfs_spiffs_vis);
#endif

//------------------------------------------------------------------------
STATIC mp_obj_t vfs_spiffs_dbg_level(mp_obj_t self_in, mp_obj_t dbglev_in)
{
    //spiffs_user_mount_t *self = MP_OBJ_TO_PTR(self_in);

    int dbg = mp_obj_get_int(dbglev_in);
    if ((dbg >= 0) && (dbg <= 16)) {
        spiffs_dbg_level = dbg;
    }

    return mp_obj_new_int(spiffs_dbg_level);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(spiffs_vfs_dbg_level_obj, vfs_spiffs_dbg_level);

//----------------------------------------------------------------------
STATIC mp_obj_t vfs_spiffs_counters(size_t n_args, const mp_obj_t *args)
{
    uint32_t rd, wr, er;
    uint64_t spitime;
    w25qxx_get_counters(&rd, &wr, &er, &spitime);

