loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/standard_lib/uos/vfs_spiffs.c
    mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(4, NULL));
    t->items[0] = mp_obj_new_int(rd);
    t->items[1] = mp_obj_new_int(wr);
    t->items[2] = mp_obj_new_int(er);
    t->items[3] = mp_obj_new_int(spitime);

    if (n_args > 1) {
        if (mp_obj_is_true(args[1])) w25qxx_clear_counters();
    }
    return MP_OBJ_FROM_PTR(t);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(spiffs_vfs_counters_obj, 1, 2, vfs_spiffs_counters);


//===============================================================
STATIC const mp_rom_map_elem_t spiffs_vfs_locals_dict_table[] = {
    #if _FS_REENTRANT
    { MP_ROM_QSTR(MP_QSTR___del__), MP_ROM_PTR(&spiffs_vfs_del_obj) },
    #endif
    { MP_ROM_QSTR(MP_QSTR_mkfs),        MP_ROM_PTR(&spiffs_vfs_mkfs_obj) },
    { MP_ROM_QSTR(MP_QSTR_open),        MP_ROM_PTR(&spiffs_vfs_open_obj) },
    { MP_ROM_QSTR(MP_QSTR_openex),      MP_ROM_PTR(&spiffs_vfs_open_ex_obj) },
    { MP_ROM_QSTR(MP_QSTR_mount),       MP_ROM_PTR(&vfs_spiffs_mount_obj) },
    { MP_ROM_QSTR(MP_QSTR_ilistdir),    MP_ROM_PTR(&spiffs_vfs_ilistdir_obj) },
    { MP_ROM_QSTR(MP_QSTR_chdir),       MP_ROM_PTR(&spiffs_vfs_chdir_obj) },
    { MP_ROM_QSTR(MP_QSTR_mkdir),       MP_ROM_PTR(&spiffs_vfs_mkdir_obj) },
    { MP_ROM_QSTR(MP_QSTR_rmdir),       MP_ROM_PTR(&spiffs_vfs_rmdir_obj) },
    { MP_ROM_QSTR(MP_QSTR_getcwd),      MP_ROM_PTR(&spiffs_vfs_getcwd_obj) },
    { MP_ROM_QSTR(MP_QSTR_remove),      MP_ROM_PTR(&spiffs_vfs_remove_obj) },
    { MP_ROM_QSTR(MP_QSTR_rename),      MP_ROM_PTR(&spiffs_vfs_rename_obj) },
    { MP_ROM_QSTR(MP_QSTR_stat),        MP_ROM_PTR(&spiffs_vfs_stat_obj) },
    { MP_ROM_QSTR(MP_QSTR_statvfs),     MP_ROM_PTR(&spiffs_vfs_statvfs_obj) },
    { MP_ROM_QSTR(MP_QSTR_umount),      MP_ROM_PTR(&spiffs_vfs_umount_obj) },
    { MP_ROM_QSTR(MP_QSTR_counters),    MP_ROM_PTR(&spiffs_vfs_counters_obj) },
    { MP_ROM_QSTR(MP_QSTR_check),       MP_ROM_PTR(&spiffs_vfs_check_obj) },
    { MP_ROM_QSTR(MP_QSTR_gc),          MP_ROM_PTR(&spiffs_vfs_gc_obj) },
    { MP_ROM_QSTR(MP_QSTR_dbg_level),   MP_ROM_PTR(&spiffs_vfs_dbg_level_obj) },
    #if SPIFFS_TEST_VISUALISATION
    { MP_ROM_QSTR(MP_QSTR_vis),         MP_ROM_PTR(&spiffs_vfs_vis_obj) },
    #endif
    // class constants
    { MP_ROM_QSTR(MP_QSTR_DBG_NONE),    MP_ROM_INT(0) },
    { MP_ROM_QSTR(MP_QSTR_DBG_GEN),     MP_ROM_INT(1) },
    { MP_ROM_QSTR(MP_QSTR_DBG_GC),      MP_ROM_INT(2) },
    { MP_ROM_QSTR(MP_QSTR_DBG_CACHE),   MP_ROM_INT(4) },
    { MP_ROM_QSTR(MP_QSTR_DBG_CHECK),   MP_ROM_INT(8) },
    { MP_ROM_QSTR(MP_QSTR_DBG_API),     MP_ROM_INT(16) },
};
STATIC MP_DEFINE_CONST_DICT(spiffs_vfs_locals_dict, spiffs_vfs_locals_dict_table);


STATIC const mp_vfs_proto_t spiffs_vfs_proto = {
    .import_stat = spiffs_vfs_import_stat,
};

const mp_obj_type_t mp_spiffs_vfs_type = {
    { &mp_type_type },
    .name = MP_QSTR_VfsFlashfs,
    .make_new = spiffs_vfs_make_new,
    .protocol = &spiffs_vfs_proto,
    .locals_dict = (mp_obj_dict_t*)&spiffs_vfs_locals_dict,
};
#endif

